## read csv untuk membaca file csv 
## df. describe untuk menampilkan rata rata, standar deviasi, nilai minimum, nilai maksimum, Q1, Q2, Q3

In [1]:
import pandas as pd

df = pd.read_csv('Forbes Top2000 2017.csv')
df.describe()

,Unnamed: 0,Rank,Sales,Profits,Assets,Market Value
count,0.0,2000.000000,2000.000000,2000.000000,2000.000000,2000.000000
mean,NaN,1000.500000,17.664510,1.240713,84.533546,24.417844
std,NaN,577.494589,29.320116,2.918742,260.984489,44.761400
min,NaN,1.000000,0.001000,-13.000000,0.001000,0.072000
25%,NaN,500.750000,4.000000,0.318000,10.875000,6.600000
50%,NaN,1000.500000,8.800000,0.613000,22.900000,11.950000
75%,NaN,1500.250000,17.425000,1.300000,52.400000,24.400000
max,NaN,2000.000000,485.300000,45.200000,3473.200000,752.000000

## untuk menampilkan nilai korelasi atribut

In [2]:
df.corr()

              Unnamed: 0      Rank     Sales   Profits    Assets  Market Value
Unnamed: 0           NaN       NaN       NaN       NaN       NaN           NaN
 Rank                NaN  1.000000 -0.526051 -0.468487 -0.348387     -0.501322
Sales                NaN -0.526051  1.000000  0.544257  0.373856      0.578612
Profits              NaN -0.468487  0.544257  1.000000  0.561030      0.741232
Assets               NaN -0.348387  0.373856  0.561030  1.000000      0.328990
Market Value         NaN -0.501322  0.578612  0.741232  0.328990      1.000000

## merubah nilai salah satu atribute bertipe bilangan bulat menjadi integer

In [3]:
Sales=df["Sales"].astype("int64")
Sales

0       151
1       134
2       222
3       102
4        97
       ...
1995      0
1996      0
1997      2
1998      0
1999      4
Name: Sales, Length: 2000, dtype: int64

## untuk melihat jumlah kolom dan baris

In [4]:
df.shape

(2000, 10)

## menampilkan 10 record pertama

In [5]:
df[["Sales"]]

        Sales
0     151.400
1     134.200
2     222.900
3     102.500
4      97.600
...       ...
1995    0.555
1996    0.630
1997    2.300
1998    0.523
1999    4.200

[2000 rows x 1 columns]

## menampilkan informasi

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    0 non-null      float64
 1    Rank         2000 non-null   int64
 2   Company       2000 non-null   object
 3   Country       2000 non-null   object
 4   Sales         2000 non-null   float64
 5   Profits       2000 non-null   float64
 6   Assets        2000 non-null   float64
 7   Market Value  2000 non-null   float64
 8   Sector        1803 non-null   object
 9   Industry      1509 non-null   object
dtypes: float64(5), int64(1), object(4)
memory usage: 156.4+ KB

## directory

In [9]:
record, attribute = df.shape
jumlah_object = df.select_dtypes(["int64", "float64"]).any().sum()
nama_attribute = df.columns.values
jumlah_null = df.isnull().any().sum()

In [10]:
hasil = {"Jumlah Record": record, "Jumlah Attribute": attribute, "Nama Atribute" : list(nama_attribute), "Jumlah Object": jumlah_object, "Jumlah Nilai Null": jumlah_null}

In [11]:
for x in hasil:
    print(x, ":", hasil[x])

Jumlah Record : 2000
Jumlah Attribute : 10
Nama Atribute : ['Unnamed: 0', ' Rank', 'Company', 'Country', 'Sales', 'Profits', 'Assets', 'Market Value', 'Sector', 'Industry']
Jumlah Object : 5
Jumlah Nilai Null : 3

## menyimpan dataset dengan atribute bertipe angka ke dalam file csv

In [12]:
df.select_dtypes(include=["int64", "float64"]).to_csv("Posttest2_csv.csv")